#include <stdarg.h>
/**
 * @file task1.c  виконати завдання 1
 * 
 * реалізувати функцію, що визначає, скільки серед заданої послідовності чисел таких пар, у котрих перше число менше наступного, використовуючи функцію з варіативною кількістю аргументів
*/

/** 
 * функція рахує кількість пар чисел, у яких перше число менше за наступне
 * @param n кількість переданих функції чисел 
*/
int number_of_pairs(int n, ...);

/**
 * головна функція = {оголошення змінної для запису результату,
                      виклик функції number_of_pairs}
*/
int main()
{   
    int count = 0;
    count = number_of_pairs(10, 17, 69, 40, 20, 50, 51, 86, 87, 20, 14);
    return 0;
}

/**
 * @param c лічильник для кількості пар чисел, у котрих перше число менше за друге
*/
int number_of_pairs(int n, ...){
    int c = 0;
    va_list argument;
    va_start (argument, n);
 /**
  * порівняння кожних двох чисел
  * якщо перше число менше за друге, то лічильник збільшується на 1
  * якщо перше число більше за друге, то программа продовжує своє виконання, не змінюючи лічильник 
 */   
    for(int i = 0; i < n; i += 2){
       int ch1 = va_arg(argument, int);
       int ch2 = va_arg(argument, int);
       if(ch1 < ch2){
           c++;
       } else continue;
    }
    return c;
}