int main(){
	#define num1 1324                //константа 1       
	#define num2 567                 //константа 2
	int res;                //змінні для запису результату та виконання операцій 
	int a, b, c;
	a = num1;                        //запис першого числа у змінну а
	b = num2;
	if(a > b && b != 0){                   //якщо а більше за б і остання не =0
       	while(b!=0){                     //виконувати дію поки б не=0
		c = a % b;                         //остача 
		a = b;                           //друге число запис. у перше
		b = c;                           //остачу запис у друге
		res = a;                           //результат = а, бо це остача перед0
	}
        }
	else if(b > a && a != 0){
		while(a != 0){
		c = b % a;
		b = a;
		a = c;
		res = b;
		}
	}
return 0;
}
