/*визначити у скільки разів значення дробової частини числа більше за цілу*/
int main() {
        #define number  123.567            
	int a = (int)number;                           //целая часть
	int b = (number - a)*1000+1;                   //дробная часть 
	double res=0, result=0;
	if (a != 0) {                                  //если а не равняется нулю
		res = (double) b / a;                  //дробную часть поделить на целую
	}
        result = (int)(res * 100) / 100.0;             //сократить ответ до двух знаков после запятой
	return 0;
}

